Revit 2026 API

# View3DResetCameraTarget Method

---

Resets the camera target to the center of the field of view.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void ResetCameraTarget()
```
```vb
Public Sub ResetCameraTarget
```
```cpp
public:
void ResetCameraTarget()
```
```fsharp
member ResetCameraTarget : unit -> unit
```

| Exception | Condition |
| --- | --- |
| InvalidOperationException | The camera target cannot be reset for the view. |

The camera target can only be reset for perspective view.

#### Reference

View3D Class

Autodesk.Revit.DB Namespace